cf/InformationRegisters/EDExchangeStatesThroughEDFOperators.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>EDExchangeStatesThroughEDFOperators</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>EDDateReceived</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LastInvitationsDateReceived</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>EDFProfileSettings</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EDFProfileSettings</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>DeleteAgreementAboutEDUsage</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EDUsageAgreements</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/EDExchangeStatesThroughEDFOperators/Forms/EditForm/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// PROCEDURE - FORM EVENT HANDLERS

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Parameters.Property("EDFProfileSettings") Then
		CurrentRecord = InformationRegisters.EDExchangeStatesThroughEDFOperators.CreateRecordManager();
		CurrentRecord.EDFProfileSettings = Parameters.EDFProfileSettings;
		
		Query = New Query;
		Query.Text =
		"SELECT TOP 1
		|	EDExchangeStatesThroughEDFOperators.EDDateReceived,
		|	EDExchangeStatesThroughEDFOperators.LastInvitationsDateReceived
		|FROM
		|	InformationRegister.EDExchangeStatesThroughEDFOperators AS EDExchangeStatesThroughEDFOperators
		|WHERE
		|	EDExchangeStatesThroughEDFOperators.EDFProfileSettings = &EDFProfileSettings";
		Query.SetParameter("EDFProfileSettings", Parameters.EDFProfileSettings);
		Selection = Query.Execute().Select();
		If Selection.Next() Then
			CurrentRecord.EDDateReceived = Selection.EDDateReceived;
			CurrentRecord.LastInvitationsDateReceived = Selection.LastInvitationsDateReceived;
		EndIf;
		ThisObject.ValueToFormAttribute(CurrentRecord, "Record");
		
	EndIf;
	
EndProcedure
